Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR34_DFP/2.1.60/Microchip.SAMR34_DFP.pdsc
      <condition id="ATSAMR34J18B">
         <require Dvendor="Microchip:3" Dname="ATSAMR34J18B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMR34J17B">
         <require Dvendor="Microchip:3" Dname="ATSAMR34J17B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.1.0" condition="ATSAMR34J16B">
         <description>Headers and startup code for Microchip ATSAMR34J16B</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr34j16b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr34j16b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr34j16b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr34j16b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr34j16b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr34j16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr34j16b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr34j16b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamr34j16b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamr34j16b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.1.0" condition="ATSAMR34J18B">
         <description>Headers and startup code for Microchip ATSAMR34J18B</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr34j18b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr34j18b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr34j18b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr34j18b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr34j18b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr34j18b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr34j18b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr34j18b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamr34j18b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamr34j18b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.1.0" condition="ATSAMR34J17B">
         <description>Headers and startup code for Microchip ATSAMR34J17B</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr34j17b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr34j17b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr34j17b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr34j17b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr34j17b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr34j17b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr34j17b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr34j17b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamr34j17b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamr34j17b/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
